## Creat Data Frame
- list, dict 통해 데이터 프레임 생성

In [1]:
import pandas as pd

In [2]:
friend_dict_list = [
    {'name':'John','age':25,'job':'student'},
    {'name':'seung','age':26,'job':'teacher'}
]
# 파이썬 코드에서 딕셔너리를 가지고 있는 리스트를 생성
# 리스트 안에 딕셔너리인 경우

In [3]:
df = pd.DataFrame(friend_dict_list)

In [4]:
df.head() # 딕셔너리 같은 경우 key 값의 순서가 보장 되지 않는다.

   age      job   name
0   25  student   John
1   26  teacher  seung

In [5]:
df = df[['name','age','job']] # 변수 순서 변경

In [6]:
df.head()

    name  age      job
0   John   25  student
1  seung   26  teacher

In [7]:
from collections import OrderedDict # 데이터 프레임을 만들때 key의 순서가 보장된다.

In [8]:
friend_orderd_dict = OrderedDict(
    [
        ('name',['John','Nate']),
        ('age',['25','30']),
        ('job',['student','teacher'])
    ]
)

In [9]:
df = pd.DataFrame.from_dict(friend_orderd_dict)

In [10]:
df

   name age      job
0  John  25  student
1  Nate  30  teacher

In [11]:
friend_list = [
    ['John',20,'student'],
    ['Nate',30,'teacher']
]

In [12]:
colums_name = ['name','age','job']

In [14]:
df = pd.DataFrame.from_records(friend_list,columns=colums_name)

In [15]:
df

   name  age      job
0  John   20  student
1  Nate   30  teacher

In [17]:
friend_list = [
    ['name',['John','Nate']],
    ['age',[20,30]],
    ['job',['student','teacher']]
]
# 리스트 안에 리스트인 경우

In [18]:
df = pd.DataFrame.from_items(friend_list)

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: from_items is deprecated. Please use DataFrame.from_dict(dict(items), ...) instead. DataFrame.from_dict(OrderedDict(items)) may be used to preserve the key order.
  """Entry point for launching an IPython kernel.

In [19]:
df

   name  age      job
0  John   20  student
1  Nate   30  teacher